{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "strides": [1, 1],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [1, 1],
            "groups": 1,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": { "seed": null }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "name": "conv2d"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2],
            "strides": [2, 2],
            "padding": "valid",
            "data_format": "channels_last",
            "name": "max_pooling2d"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": { "seed": null }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "name": "dense"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 5,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": { "seed": null }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "name": "dense_1"
          }
        }
      ]
    },
    "keras_version": "2.14.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"],
      "weights": [
        {
          "name": "conv2d/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [50176, 128],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [128, 5],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [5],
          "dtype": "float32"
        }
      ]
    }
  ]
}